{"objectives": [{"tag": "estrangeiros", "patterns": ["Existe alguma restrição para estrangeiros ingressarem na Fatec?"], "responses": ["Não, a Fatec não tem restrições para ingresso de estrangeiros, desde que atendam aos requisitos estabelecidos pelo processo seletivo."], "context": [""]}, {"tag": "fatec", "patterns": ["O que é a Fatec?"], "responses": ["A Faculdade de Tecnologia (Fatec) é uma instituição pública de ensino superior que oferece cursos de tecnologia em nível de graduação."], "context": [""]}, {"tag": "unidades", "patterns": ["Quantas unidades da Fatec existem?"], "responses": ["Atualmente, existem 73 unidades da Fatec espalhadas por todo o estado de São Paulo."], "context": [""]}, {"tag": "seleção", "patterns": ["Como funciona a seleção para ingresso na Fatec?"], "responses": ["Os candidatos são selecionados por meio de um processo seletivo que ocorre duas vezes por ano. A seleção é feita por meio de uma prova objetiva de conhecimentos gerais e uma redação."], "context": [""]}, {"tag": "cursos", "patterns": ["Quais são os cursos oferecidos pela Fatec?"], "responses": ["A Fatec oferece cursos superiores de tecnologia em diversas áreas, como informática, gestão, design e engenharia, entre outras."], "context": [""]}, {"tag": "instituição", "patterns": ["A Fatec é uma instituição pública ou privada?"], "responses": ["A Fatec é uma instituição pública de ensino superior mantida pelo governo do estado de São Paulo."], "context": [""]}, {"tag": "vantagens", "patterns": ["Quais são as vantagens de estudar na Fatec?"], "responses": ["Os cursos da Fatec são gratuitos e de qualidade reconhecida pelo mercado de trabalho. Além disso, a instituição oferece uma infraestrutura completa, com laboratórios bem equipados e corpo docente altamente qualificado."], "context": [""]}, {"tag": "apoio", "patterns": ["A Fatec oferece algum tipo de apoio ao estudante durante o curso?"], "responses": ["A Fatec oferece diversos programas de apoio ao estudante, como bolsas de estudo, estágios remunerados, orientação acadêmica e suporte psicopedagógico."], "context": [""]}, {"tag": "informações", "patterns": ["Como posso obter mais informações sobre a Fatec?"], "responses": ["Você pode obter mais informações sobre a Fatec no site oficial da instituição (www.fatec.sp.gov.br) ou por meio de contato direto com a unidade desejada."], "context": [""]}, {"tag": "simultaneo", "patterns": ["É possível fazer um curso de graduação e um curso técnico simultaneamente na Fatec?"], "responses": ["Sim, é possível fazer um curso de graduação em tecnologia e um curso técnico simultaneamente na Fatec."], "context": [""]}, {"tag": "idade", "patterns": ["Existe alguma restrição de idade para cursar a Fatec?"], "responses": ["Não, não há restrição de idade para cursar a Fatec, desde que o candidato tenha concluído o ensino médio ou equivalente."], "context": [""]}, {"tag": "enade", "patterns": ["Qual é a avaliação da Fatec no Enade?"], "responses": ["Os cursos da Fatec foram avaliados positivamente no Enade, com notas entre 3 e 5 em uma escala de 1 a 5."], "context": [""]}, {"tag": "distância", "patterns": ["A Fatec oferece alguma modalidade de ensino a distância?"], "responses": ["Não, a Fatec não oferece cursos na modalidade de ensino a distância."], "context": [""]}, {"tag": "estágio", "patterns": ["Os cursos da Fatec oferecem estágios?"], "responses": ["Sim, os cursos da Fatec oferecem estágios remunerados aos alunos que estejam matriculados e frequentes."], "context": [""]}, {"tag": "horária", "patterns": ["Qual é a carga horária dos estágios oferecidos pela Fatec?"], "responses": ["A carga horária dos estágios pode variar de acordo com o curso e a grade curricular, mas em geral ela é de cerca de 400 horas."], "context": [""]}, {"tag": "mercado", "patterns": ["A Fatec oferece algum tipo de suporte para inserção no mercado de trabalho?"], "responses": ["Sim, a Fatec oferece orientação profissional e estágios remunerados aos alunos para facilitar a inserção no mercado de trabalho."], "context": [""]}, {"tag": "trancar", "patterns": ["É possível trancar a matrícula em um curso da Fatec?"], "responses": ["Sim, é possível trancar a matrícula em um curso da Fatec e retomá-la posteriormente, desde que atenda aos critérios estabelecidos pela instituição."], "context": [""]}, {"tag": "duração", "patterns": ["Qual é a duração média dos cursos oferecidos pela Fatec?"], "responses": ["A duração dos cursos pode variar de acordo com a área de conhecimento e a grade curricular de cada curso, mas em geral eles têm duração média de dois anos."], "context": [""]}, {"tag": "reconhecido", "patterns": ["Os cursos da Fatec são reconhecidos pelo Ministério da Educação?"], "responses": ["Sim, todos os cursos oferecidos pela Fatec são reconhecidos pelo Ministério da Educação (MEC)."], "context": [""]}, {"tag": "transferência", "patterns": ["É possível realizar transferência de outra instituição para a Fatec?"], "responses": ["Sim, é possível realizar transferências de outras instituições de ensino superior para a Fatec, desde que atendam aos critérios estabelecidos pela instituição."], "context": [""]}, {"tag": "pós", "patterns": ["A Fatec oferece cursos de pós-graduação?"], "responses": ["Não, a Fatec oferece apenas cursos de graduação em tecnologia."], "context": [""]}, {"tag": "intercâmbio", "patterns": ["Existe algum programa de intercâmbio ou mobilidade estudantil na Fatec?"], "responses": ["Sim, a Fatec possui convênios com instituições de ensino superior em outros países e oferece programas de intercâmbio e mobilidade estudantil para os alunos."], "context": [""]}, {"tag": "carga", "patterns": ["Qual é a carga horária dos cursos da Fatec?"], "responses": ["A carga horária dos cursos pode variar de acordo com a área de conhecimento e a grade curricular de cada curso, mas em geral ela é de cerca de 2.400 horas."], "context": [""]}, {"tag": "financeira", "patterns": ["A Fatec oferece algum tipo de assistência financeira aos estudantes?"], "responses": ["Sim, a Fatec oferece um programa de bolsas de estudo para os estudantes que comprovem baixa renda familiar."], "context": [""]}, {"tag": "monitoria", "patterns": ["Existem atividades de monitoria para alunos da Fatec?"], "responses": ["Sim, a Fatec oferece atividades de monitoria para alunos que desejam auxiliar outros estudantes em assuntos relacionados a disciplinas específicas."], "context": [""]}, {"tag": "vestibular", "patterns": ["Qual é o período de inscrições para o vestibular da Fatec?"], "responses": ["O período de inscrições para o vestibular da Fatec varia de acordo com o semestre e é divulgado no site da instituição."], "context": [""]}, {"tag": "fluxo", "patterns": ["Os cursos da Fatec possuem algum tipo de exigência para fluxo de disciplinas?"], "responses": ["Sim, os cursos da Fatec possuem um fluxo de disciplinas definido para cada semestre e é exigido o cumprimento deste para a conclusão do curso."], "context": [""]}, {"tag": "bolsa", "patterns": ["Como é feita a seleção de alunos para as bolsas de estudo oferecidas pela Fatec?"], "responses": ["A seleção dos alunos para as bolsas de estudo é feita com base em critérios socioeconômicos e desempenho acadêmico."], "context": [""]}, {"tag": "ingressar", "patterns": ["É possível ingressar na Fatec fora do período de vestibular?"], "responses": ["É possível ingressar na Fatec no meio do semestre letivo, dependendo da disponibilidade de vagas remanescentes."], "context": [""]}, {"tag": "lingua", "patterns": ["A Fatec oferece algum curso de línguas estrangeiras?"], "responses": ["Não, atualmente a Fatec não oferece cursos de línguas estrangeiras. Somente inglês mas como parte da grade de alguns cursos"], "context": [""]}, {"tag": "proficiência", "patterns": ["A Fatec oferta algum tipo de prova de proficiência?"], "responses": ["Sim, a Fatec oferece provas de proficiência em língua inglesa e espanhola, que podem ser utilizadas para obtenção de certificado de proficiência."], "context": [""]}, {"tag": "deficiência", "patterns": ["Há algum tipo de apoio para os alunos com deficiência na Fatec?"], "responses": ["Sim, a Fatec possui Núcleos de Acessibilidade em todas as unidades, que oferecem apoio aos alunos com deficiência, incluindo recursos de acessibilidade e atendimento personalizado."], "context": [""]}, {"tag": "profissional", "patterns": ["Como é feita a seleção de professores para a Fatec?"], "responses": ["A seleção de professores é realizada por meio de processo seletivo, que avalia a formação acadêmica, experiência profissional e qualificações específicas para atuar na área."], "context": [""]}, {"tag": "critérios", "patterns": ["É possível realizar disciplinas em outras instituições enquanto estou matriculado na Fatec?"], "responses": ["Sim, é possível realizar disciplinas em outras instituições, desde que sejam reconhecidas pelo MEC e atendam aos critérios estabelecidos pela Fatec."], "context": [""]}, {"tag": "egressos", "patterns": ["Quais são as áreas de atuação dos egressos dos cursos da Fatec?"], "responses": ["Os egressos dos cursos da Fatec podem atuar em diversas áreas, como tecnologia da informação, gestão empresarial, construção civil, mecânica, automação, entre outras."], "context": [""]}, {"tag": "online", "patterns": ["A Fatec possui algum tipo de sistema online para acesso a conteúdo das disciplinas?"], "responses": ["Sim, a Fatec utiliza plataformas de ensino a distância para acesso a conteúdos das disciplinas e interação com os professores."], "context": [""]}, {"tag": "mec", "patterns": ["Como é feita a avaliação dos cursos da Fatec?"], "responses": ["A avaliação dos cursos é feita por meio do Ministério da Educação (MEC), que utiliza critérios como a nota do Exame Nacional de Desempenho dos Estudantes (ENADE), a avaliação do corpo docente, a infraestrutura e recursos pedagógicos da instituição."], "context": [""]}, {"tag": "duração", "patterns": ["Qual é a duração média dos cursos oferecidos pela Fatec?"], "responses": ["Os cursos de graduação tecnológica oferecidos pela Fatec têm duração média de 3 anos."], "context": [""]}, {"tag": "programa", "patterns": ["A Fatec oferece algum tipo de programa de pesquisa para os alunos?"], "responses": ["A Fatec possui programas de pesquisa e extensão que possibilitam a participação dos alunos em projetos científicos e tecnológicos."], "context": [""]}, {"tag": "gratuitos", "patterns": ["A Fatec oferece cursos gratuitos?"], "responses": ["A Fatec oferece cursos gratuitos, mas o processo seletivo é feito por meio de vestibular e pode haver cobrança de taxas."], "context": [""]}, {"tag": "férias", "patterns": ["Qual é o período de férias dos alunos da Fatec?"], "responses": ["O período de férias dos alunos da Fatec varia de acordo com o calendário acadêmico e pode ser consultado no site da instituição."], "context": [""]}, {"tag": "presencial", "patterns": ["Qual é a modalidade de ensino adotada pelos cursos oferecidos pela Fatec?"], "responses": ["A modalidade de ensino adotada pela Fatec é presencial."], "context": [""]}, {"tag": "empregabilidade", "patterns": ["A Fatec possui convênios com empresas para estágio e empregabilidade?"], "responses": ["Sim, a Fatec possui convênios com diversas empresas e instituições para oferta de vagas de estágio e emprego aos alunos."], "context": [""]}, {"tag": "mudar", "patterns": ["É possível mudar de curso durante a graduação na Fatec?"], "responses": ["Sim, é possível solicitar a transferência de curso dentro da Fatec, desde que haja vagas disponíveis e o aluno cumpra os requisitos necessários para o novo curso."], "context": [""]}, {"tag": "matrícula", "patterns": ["Como é o processo de matrícula para os cursos da Fatec?"], "responses": ["O processo de matrícula para os cursos da Fatec é divulgado após o resultado do vestibular e pode ser realizado online ou presencialmente, dependendo da unidade e do curso."], "context": [""]}, {"tag": "laboratórios", "patterns": ["A Fatec possui laboratórios para prática dos conteúdos das disciplinas?"], "responses": ["Sim, a Fatec possui laboratórios equipados para prática dos conteúdos das disciplinas, de acordo com as especificidades de cada curso."], "context": [""]}, {"tag": "inicio", "patterns": ["Olá", "Ola", "Bom dia", "Boa tarde", "Boa noite"], "responses": ["Olá, em que posso ajudar?", "Bem vindo ao chatbot fatec, em que posso ajudar?"], "context": [""]}, {"tag": "média", "patterns": ["Como é calculada méda da matéria?"], "responses": ["Isso depende de cada professor, mas via de regra são 2 provas e um trabalho com pesos determinados por cada docente."], "context": [""]}, {"tag": "frequência", "patterns": ["Qual é a frequência minima para não ser reprovado?"], "responses": ["O aluno deve frequentar no mínimo 75% das aulas."], "context": [""]}, {"tag": "reprovar", "patterns": ["O que acontece se eu reprovar em uma matéria"], "responses": ["A Fatec oferece a possibilidade de cursa-la novamente no próximo semestre."], "context": [""]}, {"tag": "biblioteca", "patterns": ["A fatec disponibiliza livros?"], "responses": ["A Fatec dispõe de uma bibliotéca com uma ampla variedade de livros."], "context": [""]}, {"tag": "cidades", "patterns": ["Quais cidades tem a Fatec?"], "responses": ["Campinas, Capão Bonito, Catanduva, Diadema, Franca, Itapetininga, Itapira, Itu, Jaboticabal, Jacareí, Jundiaí, Mogi Mirim, Osasco, São Paulo (Ipiranga), São Paulo (Sebrae), São Paulo (Zona Leste), Sorocaba, Tatuí, Taubaté."], "context": [""]}, {"tag": "telefone", "patterns": ["Qual o telefone da fatec?"], "responses": ["Entre em contato pelo número: 0800 596 9696 "], "context": [""]}, {"tag": "teste", "patterns": ["perguntei teste"], "responses": ["respondi teste"], "context": []}, {"tag": "treino", "patterns": ["perguntei treino"], "responses": ["respondendo ahhhhhhhhhhh"], "context": []}, {"tag": "portaria", "patterns": ["como funciona a portaria da fatec?"], "responses": ["funciona de forma manual"], "context": []}, {"tag": "duracao", "patterns": ["qual o tempo de duracao do curso?", "duracao  curso"], "responses": ["o curso tem em média 3 anos de duração"], "context": []}, {"tag": "acessibilidade", "patterns": ["a fatec tem acessibilidade?", "acessibilidade", "acesso a cadeirante"], "responses": ["a fatec contem elevador, rampa de acesso"], "context": []}]}